2023-10-24/573bc0fb82-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>前一个DEBUG总结，关于库函数底层</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">前一个DEBUG总结，关于库函数底层</h1>
<ol class="org-ol">
<li>malloc/calloc底层都是_sbrk，这个函数简单的实现就是从堆的起始地址开始，要多少分出去多少，从不管分过的区域；</li>
</ol>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold;">_sbrk</span>(<span style="font-weight: bold; text-decoration: underline;">intptr_t</span> <span style="font-weight: bold; font-style: italic;">increment</span>)
  {
        <span style="font-weight: bold;">if</span> (increment == 0) {
              <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">void</span> *)arch_mm_ctx.heap_break;
        } <span style="font-weight: bold;">else</span> {
              <span style="font-weight: bold; text-decoration: underline;">uintptr_t</span> <span style="font-weight: bold; font-style: italic;">heap_old</span> = arch_mm_ctx.heap_break;
              <span style="font-weight: bold; text-decoration: underline;">uintptr_t</span> <span style="font-weight: bold; font-style: italic;">heap_new</span> = arch_mm_ctx.heap_break + increment;

              <span style="font-weight: bold;">if</span> (heap_new &gt; ((<span style="font-weight: bold; text-decoration: underline;">uintptr_t</span>)&amp;__stackheap_end__)) {
                    errno = ENOMEM;

                    <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">void</span> *)-1;
              } <span style="font-weight: bold;">else</span> {
                    arch_mm_ctx.heap_break = heap_new;

                    <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">void</span> *)heap_old;
              }
        }
  }
</pre>
</div>
<ol class="org-ol">
<li>_start中做的事情，和具体硬件实现有关，M7的SP设置就由约定放置，初始库里面的init.array和final.array就没有啥用，还有_exit，在main退出后执行，也没有啥用；</li>
<li>因此，M7的启动只需要将BSS初始化为0，和进行data段这种需要由FLASH搬运到SRAM的操作；</li>
<li>启动库和C库有着明显的区分；以后都不要C库了，只是用C库；</li>
<li>但C库，参照armv8-A的实现，需要实现如下函数(其实armv7-m里面没有实现也可以直接用库里面的实现)：</li>
</ol>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">  #include</span> <span style="font-style: italic;">&lt;stdarg.h&gt;</span>
<span style="font-weight: bold;">  #include</span> <span style="font-style: italic;">&lt;stdint.h&gt;</span>
<span style="font-weight: bold;">  #include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">  #include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>

  <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold;">memset</span>(<span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">s</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">c</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">count</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">xs</span> = s;
        <span style="font-weight: bold;">while</span> (count--)
              *xs++ = (<span style="font-weight: bold; text-decoration: underline;">char</span>)c;
        <span style="font-weight: bold;">return</span> s;
  }

  <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold;">memcpy</span>(<span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">dst</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">src</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>)
  {
        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">copy per 1 byte</span><span style="font-weight: bold; font-style: italic;"> */</span>
        <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">p</span> = src;
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">q</span> = dst;

        <span style="font-weight: bold;">while</span> (n--) {
              *q++ = *p++;
        }

        <span style="font-weight: bold;">return</span> dst;
  }

  <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold;">strncpy</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">dest</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">src</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">i</span>;

        <span style="font-weight: bold;">for</span> (i = 0; i &lt; n &amp;&amp; src[i] != 0; i++)
              dest[i] = src[i];
        <span style="font-weight: bold;">for</span> (; i &lt; n; i++)
              dest[i] = <span style="font-style: italic;">'\0'</span>;

        <span style="font-weight: bold;">return</span> dest;
  }

  <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold;">strchr</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">str</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">c</span>)
  {
        <span style="font-weight: bold;">do</span> {
              <span style="font-weight: bold;">if</span> (*str == (<span style="font-weight: bold; text-decoration: underline;">char</span>)c)
                    <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">char</span> *)str;
              str++;
        } <span style="font-weight: bold;">while</span> (*str);

        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
  }

  <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold;">strlen</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">str</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">tmp</span> = (<span style="font-weight: bold; text-decoration: underline;">char</span> *)str;
        <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">counter</span> = 0;
        <span style="font-weight: bold;">while</span> (*tmp++)
              ++counter;
        <span style="font-weight: bold;">return</span> counter;
  }

  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">uint_to_str</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">buf</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">base</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">digit_10</span>[] = <span style="font-style: italic;">"0123456789"</span>;
        <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">digit_16</span>[] = <span style="font-style: italic;">"0123456789abcdef"</span>;
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">shifter</span> = i;
        <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold;">const</span> *<span style="font-weight: bold; font-style: italic;">digit</span>;

        <span style="font-weight: bold;">if</span> (base == 10)
              digit = digit_10;
        <span style="font-weight: bold;">else</span>
              digit = digit_16;

        <span style="font-weight: bold;">do</span> {
              ++buf;
              shifter = shifter / base;
        } <span style="font-weight: bold;">while</span> (shifter);

        *buf = <span style="font-style: italic;">'\0'</span>;

        <span style="font-weight: bold;">do</span> {
              *--buf = digit[i % base];
              i = i / base;
        } <span style="font-weight: bold;">while</span> (i);
  }

  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">int_to_str</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">buf</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">base</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">sign</span> = i;

        <span style="font-weight: bold;">if</span> (i &lt; 0) {
              i = -i;
              buf++;
        }

        uint_to_str((<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>)i, buf, base);

        <span style="font-weight: bold;">if</span> (sign &lt; 0)
              *--buf = <span style="font-style: italic;">'-'</span>;
  }

  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">isdigit</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">c</span>)
  {
        <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">int</span>)(c &gt;= <span style="font-style: italic;">'0'</span> &amp;&amp; c &lt;= <span style="font-style: italic;">'9'</span>);
  }

  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">handle_num</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">type</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">buf</span>, <span style="font-weight: bold; text-decoration: underline;">va_list</span> *<span style="font-weight: bold; font-style: italic;">args</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">int_num</span>;
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">uint_num</span>;

        <span style="font-weight: bold;">switch</span> (type) {
        <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'u'</span>:
              uint_num = va_arg(*args, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>);
              uint_to_str(uint_num, buf, 10);
              <span style="font-weight: bold;">break</span>;
        <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'d'</span>:
              int_num = va_arg(*args, <span style="font-weight: bold; text-decoration: underline;">int</span>);
              int_to_str(int_num, buf, 10);
              <span style="font-weight: bold;">break</span>;
        <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'x'</span>:
              uint_num = va_arg(*args, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>);
              uint_to_str(uint_num, buf, 16);
              <span style="font-weight: bold;">break</span>;
        <span style="font-weight: bold;">default</span>:
              <span style="font-weight: bold;">return</span> 1;
              <span style="font-weight: bold;">break</span>;
        }

        <span style="font-weight: bold;">return</span> 0;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">vsnprintf</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">str</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">format</span>, <span style="font-weight: bold; text-decoration: underline;">va_list</span> <span style="font-weight: bold; font-style: italic;">args</span>)
  {
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">pos</span>;
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">s</span>;
        <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">tmp</span> = str;
        <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">length</span> = 0;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">num_length</span>, <span style="font-weight: bold; font-style: italic;">min_length</span>;
        <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">num_buf</span>[12];
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">not_implemented</span>;

        <span style="font-weight: bold;">for</span> (pos = (<span style="font-weight: bold; text-decoration: underline;">char</span> *)format; *pos != <span style="font-style: italic;">'\0'</span>; pos++) {
              <span style="font-weight: bold;">while</span> ((*pos != <span style="font-style: italic;">'%'</span>) &amp;&amp; (*pos != <span style="font-style: italic;">'\0'</span>) &amp;&amp; (length &lt; n)) {
                    *tmp++ = *pos++;
                    length++;
              }

              <span style="font-weight: bold;">if</span> (length == n)
                    <span style="font-weight: bold;">break</span>;

              <span style="font-weight: bold;">if</span> (*pos == <span style="font-style: italic;">'\0'</span>) {
                    *tmp = <span style="font-style: italic;">'\0'</span>;
                    <span style="font-weight: bold;">break</span>;
              }

              pos++;

              not_implemented = 0;

              <span style="font-weight: bold;">switch</span> (*pos) {
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'s'</span>:
                    s = va_arg(args, <span style="font-weight: bold; text-decoration: underline;">char</span> *);
                    strncpy(tmp, s, n - length);
                    <span style="font-weight: bold;">break</span>;
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'0'</span>:
                    <span style="font-weight: bold;">if</span> (isdigit(*(pos + 1)) &amp;&amp; (*(pos + 1) &gt; <span style="font-style: italic;">'0'</span>)) {
                          pos++;
                    } <span style="font-weight: bold;">else</span> {
                          not_implemented = 1;
                          <span style="font-weight: bold;">break</span>;
                    }
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'1'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'2'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'3'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'4'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'5'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'6'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'7'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'8'</span>:
              <span style="font-weight: bold;">case</span> <span style="font-style: italic;">'9'</span>:
                    min_length = (<span style="font-weight: bold; text-decoration: underline;">int</span>)(*pos - <span style="font-style: italic;">'0'</span>);

                    <span style="font-weight: bold;">if</span> (handle_num(*(pos + 1), num_buf, &amp;args)) {
                          <span style="font-weight: bold;">if</span> (*(pos - 1) == <span style="font-style: italic;">'0'</span>)
                                pos--;

                          not_implemented = 1;
                          <span style="font-weight: bold;">break</span>;
                    }

                    num_length = (<span style="font-weight: bold; text-decoration: underline;">int</span>)strlen(num_buf);

                    <span style="font-weight: bold;">if</span> (num_length &lt; min_length) {
                          <span style="font-weight: bold;">while</span> (num_length &gt;= 0)
                                num_buf[min_length--] = num_buf[num_length--];

                          <span style="font-weight: bold;">if</span> (*(pos - 1) == <span style="font-style: italic;">'0'</span>) {
                                <span style="font-weight: bold;">if</span> (num_buf[0] == <span style="font-style: italic;">'-'</span>) {
                                      min_length++;
                                      <span style="font-weight: bold;">while</span> (min_length &gt; 0)
                                            num_buf[min_length--] = <span style="font-style: italic;">'0'</span>;
                                } <span style="font-weight: bold;">else</span> {
                                      <span style="font-weight: bold;">while</span> (min_length &gt;= 0)
                                            num_buf[min_length--] = <span style="font-style: italic;">'0'</span>;
                                }
                          } <span style="font-weight: bold;">else</span> {
                                <span style="font-weight: bold;">while</span> (min_length &gt;= 0)
                                      num_buf[min_length--] = <span style="font-style: italic;">' '</span>;
                          }
                    }
                    strncpy(tmp, num_buf, n - length);
                    pos++;
                    <span style="font-weight: bold;">break</span>;
              <span style="font-weight: bold;">default</span>:
                    <span style="font-weight: bold;">if</span> (handle_num(*pos, num_buf, &amp;args))
                          not_implemented = 1;
                    <span style="font-weight: bold;">else</span>
                          strncpy(tmp, num_buf, n - length);
                    <span style="font-weight: bold;">break</span>;
              }

              <span style="font-weight: bold;">if</span> (not_implemented) {
                    va_arg(args, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>);
                    *tmp++ = <span style="font-style: italic;">'%'</span>;
                    length++;
                    pos--;
              } <span style="font-weight: bold;">else</span> {
                    <span style="font-weight: bold;">while</span> ((*tmp != <span style="font-style: italic;">'\0'</span>) &amp;&amp; (length &lt; n)) {
                          tmp++;
                          length++;
                    }
              }
        }

        <span style="font-weight: bold;">if</span> (tmp == str) {
              *tmp = <span style="font-style: italic;">'\0'</span>;
        } <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> (length == n) {
              tmp--;
              <span style="font-weight: bold;">if</span> (*tmp != <span style="font-style: italic;">'\0'</span>)
                    *tmp = <span style="font-style: italic;">'\0'</span>;
              <span style="font-weight: bold;">else</span>
                    length--;
        } <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> (*(tmp - 1) != <span style="font-style: italic;">'\0'</span>) {
              *tmp = <span style="font-style: italic;">'\0'</span>;
        } <span style="font-weight: bold;">else</span> {
              length--;
        }

        <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">int</span>)length;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">snprintf</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">str</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">size</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">format</span>, ...)
  {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">counter</span>;
        <span style="font-weight: bold; text-decoration: underline;">va_list</span> <span style="font-weight: bold; font-style: italic;">args</span>;
        va_start(args, format);
        counter = vsnprintf(str, size, format, args);
        va_end(args);
        <span style="font-weight: bold;">return</span> counter;
  }

  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">__assert_fail</span>(
                     <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">assertion</span>,
                     <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">file</span>,
                     <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">line</span>,
                     <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">function</span>)
  {
        <span style="font-weight: bold;">while</span> (1)
              <span style="font-weight: bold;">continue</span>;
  }
</pre>
</div>
<p>
不知道是arm CA和库怎么不适配了，我的板子，snprintf这类函数也需要重写才行；</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
